In [113]:
# Pandas
import pandas as pd
import matplotlib.pyplot as plt
# SQL Alchemy
from sqlalchemy import create_engine

In [114]:
import psycopg2

In [115]:
from sqlalchemy import create_engine
engine = create_engine('postgresql+psycopg2://postgres:postgres@localhost:5433/employees')
connection = engine.connect()

In [116]:
employee_data = pd.read_sql("SELECT * FROM employees", connection)
employee_data

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18
...,...,...,...,...,...,...,...
300019,464231,s0001,1958-08-14,Constantino,Eastman,M,1988-10-28
300020,255832,e0002,1955-05-08,Yuping,Dayang,F,1995-02-26
300021,76671,s0001,1959-06-09,Ortrud,Plessier,M,1988-02-24
300022,264920,s0001,1959-09-22,Percy,Samarati,F,1994-09-08
300023,464503,s0002,1964-05-31,Arvind,Slobodova,M,1987-11-23

In [ ]:
dept_emp_data = pd.read_sql("SELECT * FROM dept_emp", connection)
dept_emp_data

In [ ]:
# No null values
salary_data = pd.read_sql("SELECT * FROM salaries ORDER BY salary", connection)
salary_data

In [ ]:
title_data = pd.read_sql("SELECT * FROM titles", connection)
title_data

In [ ]:
##  Create a histogram to visualize the most common salary ranges for employees.

fig=plt.figure(figsize=(10,6))
plt.hist(salary_data["salary"])
plt.xlabel("Employee Salary", fontsize=15)
plt.ylabel("Salary Value",fontsize=15)
plt.ylim(0, 160000)
plt.title("Most Common Salary Ranges For Employees", fontsize=18)
plt.show()

In [ ]:
##Merge for Average Bar chart

emp_sal_merge = salary_data.merge(employee_data, left_on='emp_no', right_on='emp_no')
emp_title_sal= emp_sal_merge.merge(title_data, left_on='emp_title_id', right_on='title_id')
emp_title_sal

In [ ]:
## Groupby title and Salary mean

title_group = emp_title_sal.groupby(["title"])["salary"].mean()
salary_mean = title_group.reset_index()
salary_mean

In [ ]:
## Create a bar chart of average salary by title.

x = salary_mean['title']
y = salary_mean['salary']

fig, ax = plt.subplots(figsize=(10,6))
ax.bar(x, y, color='red', alpha=0.5, width = 0.5, align="center")
plt.xlabel("Title Name")
plt.ylabel("Salary")
plt.title("Average Salary By Title")

# rotate axis labels
plt.setp(plt.gca().get_xticklabels(), rotation=45, horizontalalignment='right')
plt.show()

In [ ]:
##Search your ID number
search_id = pd.read_sql("SELECT emp_no, first_name, last_name,sex FROM employees WHERE emp_no = 499942;", connection)
search_id